tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void sendRecordFlowAlertSummary(const WateringRecordPayload& payload,
                                const IrrigationConfig* config) {
    const uint8_t total = recordFlowAlertZoneCount(payload);
    if (total == 0) {
        Esp32BaseWeb::sendChunk("未触发高低流量报警");
        return;
    }
    if (total > 1) {
        sendUnsigned(total);
        Esp32BaseWeb::sendChunk(" 路曾触发高低流量报警");
        return;
    }
    for (uint8_t index = 0; index < payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = payload.zones[index];
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0) {
            continue;
        }
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        const bool low =
            (zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0;
        const bool high =
            (zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0;
        Esp32BaseWeb::sendChunk(low && high
            ? "曾触发低流量和高流量报警"
            : high ? "曾触发高流量报警" : "曾触发低流量报警");
        return;
    }
}

struct LatestRecordContext {
    bool found = false;
    StoredWateringRecord record{};
};

void collectLatestRecord(const StoredWateringRecord& record, void* user) {
    auto* context = static_cast<LatestRecordContext*>(user);
    if (context && !context->found) {
        context->record = record;
        context->found = true;
    }
}

void html(const char* text) { Esp32BaseWeb::sendChunk(text); }
void escaped(const char* text) { Esp32BaseWeb::writeHtmlEscaped(text ? text : ""); }
void hidden(const char* name, uint32_t value) {
    html("<input type='hidden' name='"); escaped(name); html("' value='"); sendUnsigned(value); html("'>");
}
void epochText(uint32_t epoch, const char* format = "%m-%d %H:%M") {
    char text[32]{};
    if (epoch && Esp32BaseTime::formatEpoch(epoch, text, sizeof(text), format)) escaped(text);
    else html("时间未知");
}
uint32_t selectedDay() {
    char date[12]{}, dateTime[24]{}; uint32_t epoch = 0;
    if (getParam("date", date, sizeof(date)) && std::strlen(date) == 10) {
        std::snprintf(dateTime, sizeof(dateTime), "%sT00:00", date);
        if (IrrigationTime::parseLocalDateTimeUtc8(dateTime, epoch)) return WateringHistory::localDay(epoch);
    }
    const auto now = Esp32BaseTime::snapshot();
    return now.synced ? WateringHistory::localDay(now.epochSec) : 0;
}
void dayText(uint32_t day) { epochText(day * 86400U - 8U * 3600U, "%Y-%m-%d"); }
void dateNav(uint32_t day) {
    html("<nav class='actions' aria-label='选择日期'><a class='btnlink secondary' href='?date="); dayText(day - 1);
    html("' aria-label='前一天'>‹</a><form method='get' style='margin:0'><input aria-label='日期' type='date' name='date' value='"); dayText(day);
    html("' onchange='this.form.submit()'><noscript><button>查看</button></noscript></form><a class='btnlink secondary' href='?date="); dayText(day + 1);
    html("' aria-label='后一天'>›</a><a href='?'>今天</a></nav>");
}
void conditions() {
    html("<section id='conditions' class='conditions' aria-label='设备状态'>");
    if (!g_app->businessReady()) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,"灌溉功能未就绪","输出保持关闭；请到设备设置检查配置、存储及系统状态。");
    if (g_app->recordStorageFault()) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,"浇水记录无法可靠保存","暂不能开始新任务。正常历史轮转不会导致此状态；请检查存储或任务恢复信息。");
    if (g_app->eventStorageFault()) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,"操作记录保存异常","部分配置操作暂不可用，请检查设备存储。");
    if (g_app->schedulerStorageFault()) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,"自动调度状态不可用","自动计划不能执行，请检查设备状态。");
    const auto time = g_app->schedulerTimeState();
    if (time != WateringScheduler::TimeState::Ready) {
        html("<details class='notice warn'><summary>");
        html(time == WateringScheduler::TimeState::RtcRollback ? "设备时间倒退，自动计划暂停" : "设备时间尚不可信，自动计划暂停");
        html("</summary><p>等待硬件时钟或网络校时恢复；手动浇水仍受现场保护。错过的计划不会自动补浇。</p></details>");
    }
    const auto rtc = g_app->eventConditionState(1);
    if (rtc == IrrigationEvents::ConditionDisplayState::Active || rtc == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery)
        html("<details class='notice warn'><summary>硬件时钟不可用</summary><p>有可信网络时间时仍可自动执行；失去可信时间后自动计划暂停。请检查 RTC 接线与电池。</p></details>");
    if (g_app->unexpectedFlowAlarm()) html("<details class='notice danger'><summary>关闭输出后仍检测到水流</summary><p>可能存在阀未关严、余流或其他水流来源，请检查现场；必要时关闭上游水源。设备无法仅凭总流量计判定具体漏水位置。</p></details>");
    html("</section>");
}
void renderDay(uint32_t day) {
    if (!day) { html("<p class='muted'>设备时间未知，日期统计暂不可用。仍可查看全部浇水记录。</p>"); return; }
    const auto daily = g_app->wateringDay(day); const auto* config = g_app->configuration();
    if (!daily.readable) { html("<p class='notice warn'>记录暂时无法读取，不能据此判断没有浇水。</p>"); return; }
    html("<div class='home-grid'>");
    bool shown = false;
    for (size_t i = 0; i < daily.zones.size(); ++i) {
        const auto& z = daily.zones[i];
        if ((!config || !config->zones[i].enabled) && !z.count && !z.failures && !z.unknown && !z.active) continue;
        shown = true;
        html("<a class='home-plan' style='text-decoration:none;color:inherit' href='/irrigation/records?date="); dayText(day); html("&zone="); sendUnsigned(i + 1); html("'><span class='zone-title'>");
        sendZoneName(config, i); html("</span><b class='home-main'>");
        if (z.unknown && !z.count) html("时长未知"); else sendDuration(z.seconds);
        html("</b><span>"); sendUnsigned(z.count); html(" 次出水");
        if (z.active) html(" · 进行中，暂计");
        else if (z.failures) { html(" · "); sendUnsigned(z.failures); html(" 次停止或异常"); }
        else if (!z.count && !z.unknown) html(" · 暂无出水记录");
        if (z.unknown) { html(" · "); sendUnsigned(z.unknown); html(" 次结果不完整"); }
        html("</span><small>估算用水 ");
        if (z.unknown && !z.count) html("未知"); else { sendWaterVolume(z.waterMl); if (z.unknown) html("（仅已知部分）"); }
        html("</small></a>");
    }
    html("</div>");
    if (!shown) html("<p class='muted'>暂无启用水路或该日记录。请到设备设置配置水路。</p>");
    if (daily.truncated) html("<p class='notice warn'>较早历史已滚动淘汰，本日统计可能不完整。</p>");
    if (daily.unknownTimeCount) { html("<p class='muted'>另有 "); sendUnsigned(daily.unknownTimeCount); html(" 条时间未知的记录未计入日期统计。</p>"); }
    html("<p class='muted'>按各水路开始日期归属；跨日任务不拆分。时长为实际浇水时间，水量为估算值。</p>");
}
const char* outcome(const WateringRecordPayload& p) {
    if (p.result == WateringResult::Incomplete) return "运行中断 · 结果不完整";
    return recordOutcomeName(p);
}
struct RecordRowsContext {
    const IrrigationConfig* config;
    uint32_t emitted;
};

void sendRecordDetailDialog(const StoredWateringRecord& record,
                            const IrrigationConfig* config,
                            const char* dialogPrefix) {
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    const uint8_t plannedZoneCount = recordPlannedZoneCount(record.payload);
    const uint8_t startedZoneCount = recordStartedZoneCount(record.payload);
    const uint8_t baselineZoneCount = recordBaselineZoneCount(record.payload);
    const uint8_t alertZoneCount = recordFlowAlertZoneCount(record.payload);
    Esp32BaseWeb::sendChunk("<dialog id='");
    Esp32BaseWeb::sendChunk(dialogPrefix);
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal record-detail-dialog' data-eb-light-dismiss='1'><div class='record-detail-head'><div><span class='muted'>");
    sendRecordSource(record.payload, config);
    Esp32BaseWeb::sendChunk("</span><h2>");
    epochText(record.payload.startedEpoch, "%m月%d日 %H:%M");
    Esp32BaseWeb::sendChunk("</h2></div><button type='button' class='secondary record-detail-close' onclick='this.closest(\"dialog\").close()'>关闭</button></div><div class='record-detail-result'><span class='tag ");
    Esp32BaseWeb::sendChunk(recordOutcomeTone(record.payload));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(outcome(record.payload));
    Esp32BaseWeb::sendChunk("</span><span>");
    sendRecordOutcomeSummary(record.payload, config);
    Esp32BaseWeb::sendChunk("</span></div><div class='record-detail-metrics'><div><span>实际浇水</span><b>");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</b></div><div><span>估算用水量</span><b>");
    if (recordHasCappedEstimate(record.payload)) {
        Esp32BaseWeb::sendChunk("至少 ");
    }
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</b></div><div><span>执行水路</span><b>");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendUnsigned(startedZoneCount);
    Esp32BaseWeb::sendChunk(" / ");
    sendUnsigned(plannedZoneCount);
    Esp32BaseWeb::sendChunk(" 路</b></div><div><span>高低流量报警</span><b>");
    if (record.payload.result == WateringResult::Incomplete) { html("未能确认"); }
    else if (alertZoneCount == 0) {
        Esp32BaseWeb::sendChunk("无");
    } else {
        sendUnsigned(alertZoneCount);
        Esp32BaseWeb::sendChunk(" 路");
    }
    Esp32BaseWeb::sendChunk("</b><small>");
    sendUnsigned(baselineZoneCount);
    Esp32BaseWeb::sendChunk(" / ");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendUnsigned(startedZoneCount);
    Esp32BaseWeb::sendChunk(" 路设置了基准</small></div></div><div class='record-detail-section'><h3>执行时间</h3><div class='record-detail-grid'><div class='record-time-range'><b>开始 — 完成</b><span>");
    if (record.payload.result == WateringResult::Incomplete) { epochText(record.payload.startedEpoch); html(" — 中断时间未知"); }
    else sendRecordTimeRange(record.timing);
    Esp32BaseWeb::sendChunk("</span></div><div><b>执行目标</b><span>");
    const uint32_t targetWaterMl = recordTargetWaterMl(record.payload);
    if (targetWaterMl != 0) sendWaterVolume(targetWaterMl);
    else sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</span></div><div><b>任务总历时</b><span>");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendDuration(record.timing.durationSec);
    Esp32BaseWeb::sendChunk("</span></div></div></div><div class='record-detail-section'><h3>水路明细</h3><p>计划和水路名称按当前设置显示；流量、基准和用水量均保留浇水当时的记录。</p><div class='tablewrap'><table class='record-zone-table'><thead><tr><th>水路</th><th>执行结果</th><th>实际 / 目标</th><th>估算用水量</th><th>当时基准流量</th><th>流量表现</th></tr></thead><tbody>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<tr><td data-label='水路'><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b></td><td data-label='执行结果'>");
        const bool unknown = (zone.flags & WateringRecordCodec::kZoneFlagUnknown) != 0;
        html(unknown ? "执行结果未知" : zoneResultName(zone.result));
        Esp32BaseWeb::sendChunk("</td><td data-label='实际 / 目标' class='record-duration-pair'><b>");
        if (unknown) html("未知"); else sendDuration(zone.actualWateringSec);
        Esp32BaseWeb::sendChunk("</b><span>/</span><small>");
        if (zone.targetWaterMl != 0) sendWaterVolume(zone.targetWaterMl);
        else sendDuration(zone.plannedDurationSec);
        Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("至少 ");
        }
        if (unknown) html("未知"); else sendWaterVolume(zone.estimatedWaterMl);
        if ((zone.flags & WateringRecordCodec::kZoneFlagWaterEstimateCapped) != 0) {
            Esp32BaseWeb::sendChunk("<small class='warn'>达到记录上限</small>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-label='当时基准流量' class='record-baseline'>");
        const bool baselineAvailable =
            (zone.flags &
             WateringRecordCodec::kZoneFlagFlowBaselineAvailable) != 0;
        if (unknown) { html("未知"); }
        else if (zone.result == ZoneWateringResult::NotStarted) {
            Esp32BaseWeb::sendChunk("<span class='muted'>—</span>");
        } else if (baselineAvailable) {
            sendFlowRate(zone.baselineFlowMlPerMinute);
        } else {
            Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span><small>本次不进行高低流量判定</small>");
        }
        Esp32BaseWeb::sendChunk("</td><td data-label='流量表现'><div class='record-flow-performance'>");
        if (unknown) { html("未知"); }
        else if (zone.result == ZoneWateringResult::NotStarted) {
            Esp32BaseWeb::sendChunk("<span class='muted'>—</span>");
        } else if (zone.actualWateringSec == 0) {
            Esp32BaseWeb::sendChunk("<span class='muted'>未建立有效水流</span>");
        } else {
            Esp32BaseWeb::sendChunk("<span>整段平均 ");
            sendFlowRate(zone.averageFlowMlPerMinute);
            if (baselineAvailable) {
                char comparison[48]{};
                formatFlowChange(zone.averageFlowMlPerMinute,
                                 zone.baselineFlowMlPerMinute,
                                 comparison,
                                 sizeof(comparison));
                Esp32BaseWeb::sendChunk("，较基准 ");
                Esp32BaseWeb::writeHtmlEscaped(comparison);
            }
            Esp32BaseWeb::sendChunk("</span>");
            Esp32BaseWeb::sendChunk(
                "<span class='muted'>本地记录仅保留整段平均流量</span>");
        }
        Esp32BaseWeb::sendChunk("<div class='record-flags'>");
        if ((zone.flags & WateringRecordCodec::kZoneFlagLowFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag warn'>曾触发低流量报警</span>");
        }
        if ((zone.flags & WateringRecordCodec::kZoneFlagHighFlow) != 0) {
            Esp32BaseWeb::sendChunk("<span class='tag danger'>曾触发高流量报警</span>");
        }
        if ((zone.flags & (WateringRecordCodec::kZoneFlagLowFlow |
                           WateringRecordCodec::kZoneFlagHighFlow)) == 0 &&
            baselineAvailable && !unknown) {
            Esp32BaseWeb::sendChunk("<span class='tag ok'>未触发高低流量报警</span>");
        }
        Esp32BaseWeb::sendChunk("</div></div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><p class='record-detail-note'>相对基准差值用于解释流量表现，不等同于报警结果；报警以浇水当时的阈值和连续判定结果为准。</p></div><details class='record-technical' open><summary>指标与技术说明</summary><p class='record-technical-note'>整段平均只统计水流建立后的实际浇水阶段；估算用水量还包含建立水流和关阀尾水阶段的实际脉冲。未触发报警不等于流量一定正常，没有基准时不作高低流量判定。</p><div class='record-technical-grid'><div><b>总脉冲</b><span>");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendUnsigned64(totals.pulseCount);
    Esp32BaseWeb::sendChunk("</span></div>");
    for (uint8_t index = 0; index < record.payload.zones.size(); ++index) {
        const ZoneWateringRecord& zone = record.payload.zones[index];
        if (zone.plannedDurationSec == 0) continue;
        Esp32BaseWeb::sendChunk("<div><b>");
        if (config) {
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
        } else {
            Esp32BaseWeb::sendChunk("水路 ");
            sendUnsigned(index + 1U);
        }
        Esp32BaseWeb::sendChunk("</b><span>");
        if (zone.flags & WateringRecordCodec::kZoneFlagUnknown) html("未知");
        else sendUnsigned(zone.pulseCount);
        Esp32BaseWeb::sendChunk(" 脉冲</span></div>");
    }
    Esp32BaseWeb::sendChunk("</div></details><div class='actions record-detail-bottom-close'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>关闭</button></div></dialog>");
}

void sendRecordRow(const StoredWateringRecord& record, void* user) {
    RecordRowsContext* context = static_cast<RecordRowsContext*>(user);
    const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(record.payload);
    if (context) ++context->emitted;
    Esp32BaseWeb::sendChunk("<tr><td data-label='开始时间' class='record-time'>");
    epochText(record.payload.startedEpoch);
    Esp32BaseWeb::sendChunk("</td><td data-label='浇水任务'>");
    sendRecordSource(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='执行水路' class='record-zones'>");
    sendRecordWateredZones(record.payload, context ? context->config : nullptr);
    Esp32BaseWeb::sendChunk("</td><td data-label='执行结果'><span class='tag ");
    Esp32BaseWeb::sendChunk(recordOutcomeTone(record.payload));
    Esp32BaseWeb::sendChunk("'>");
    Esp32BaseWeb::sendChunk(outcome(record.payload));
    Esp32BaseWeb::sendChunk("</span>");
    if (record.payload.result != WateringResult::Completed) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        sendRecordOutcomeSummary(
            record.payload, context ? context->config : nullptr);
        Esp32BaseWeb::sendChunk("</small>");
    } else if (recordHasFlowAlert(record.payload)) {
        Esp32BaseWeb::sendChunk("<small class='record-result-reason'>");
        sendRecordFlowAlertSummary(
            record.payload, context ? context->config : nullptr);
        Esp32BaseWeb::sendChunk("</small>");
    }
    Esp32BaseWeb::sendChunk("</td><td data-label='实际 / 目标' class='record-number record-list-duration'><span>");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendDuration(totals.actualWateringSec);
    Esp32BaseWeb::sendChunk("</span><small>/ ");
    const uint32_t targetWaterMl = recordTargetWaterMl(record.payload);
    if (targetWaterMl != 0) sendCompactWaterVolume(targetWaterMl);
    else sendDuration(totals.plannedDurationSec);
    Esp32BaseWeb::sendChunk("</small></td><td data-label='估算用水量' class='record-number'>");
    if (recordHasCappedEstimate(record.payload)) Esp32BaseWeb::sendChunk("至少 ");
    if (record.payload.result == WateringResult::Incomplete) html("未知");
    else sendCompactWaterVolume(totals.estimatedWaterMl);
    Esp32BaseWeb::sendChunk("</td><td data-label='操作' class='record-action'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('record-detail-");
    sendUnsigned(record.recordId);
    Esp32BaseWeb::sendChunk("').showModal()\">查看详情</button>");
    sendRecordDetailDialog(record, context ? context->config : nullptr, "record-detail-");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

struct HistoryRows { uint32_t day=0, zone=0, offset=0, matched=0, shown=0; const char* result=nullptr; };
void historyRow(const StoredWateringRecord& record, void* user) {
    auto& q = *static_cast<HistoryRows*>(user); const auto& p = record.payload;
    bool matches = !q.day && !q.zone;
    for(size_t i=0;i<p.zones.size();++i) {
        const auto& z=p.zones[i]; if(!z.plannedDurationSec || (q.zone && q.zone != i+1)) continue;
        if(!q.day || (p.startedEpoch && WateringHistory::localDay(WateringHistory::zoneEpoch(p,i))==q.day)) matches=true;
    }
    if(!matches) return;
    if(q.result && !strcmp(q.result,"issues") && p.result==WateringResult::Completed && !recordFlowAlertZoneCount(p)) return;
    if(q.matched++ < q.offset || q.shown>=20) return; ++q.shown;
    RecordRowsContext row{g_app->configuration(), 0};
    sendRecordRow(record, &row);
}
struct AuditRows { uint32_t day=0, offset=0, matched=0, shown=0; bool skippedOnly=false; };
void auditRow(const IrrigationEvents::EventRecord& event, void* user) {
    auto& q=*static_cast<AuditRows*>(user); uint32_t epoch=0;
    Esp32BaseRecordStore::resolveCompletedEpoch(event.timing,epoch);
    if(q.day && (!epoch || WateringHistory::localDay(epoch)!=q.day)) return;
    if(q.skippedOnly && event.eventCode!=uint32_t(IrrigationEvents::EventCode::AutomaticPlanSkipped)) return;
    if(q.matched++ < q.offset || q.shown>=20) return; ++q.shown;
    char title[192]{}, summary[256]{};
    const auto* config=g_app->configuration();
    const auto planId=IrrigationEvents::wateringPlanId(event);
    const char* zoneName=config && event.objectId>=1 && event.objectId<=BoardPins::kZoneCount ? config->zones[event.objectId-1].name.data() : nullptr;
    IrrigationEvents::formatTitle(event,title,sizeof(title),planNameById(config,planId),zoneName);
    IrrigationEvents::formatSummary(event,summary,sizeof(summary));
    html("<tr><td data-label='时间' class='event-time'>"); epochText(epoch);
    html("</td><td data-label='等级' class='event-level'><span class='tag ");
    html(event.level==IrrigationEvents::Level::Error ? "danger" : event.level==IrrigationEvents::Level::Warning ? "warn" : "info");
    html("'>"); escaped(IrrigationEvents::levelName(event.level)); html("</span></td><td data-label='事件' class='event-title'>");
    escaped(title); html("</td><td data-label='说明' class='event-summary'>"); escaped(summary); html("</td></tr>");
}

