tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
} // namespace

bool IrrigationWeb::registerRoutes(IrrigationApp& app) {
    g_app=&app;
    Esp32BaseWeb::setDeviceName("智能浇水"); Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP); Esp32BaseWeb::setHomePath("/irrigation");
    return IrrigationWebAssets::registerAssets() &&
        Esp32BaseWeb::addPage("/irrigation","首页",overview) &&
        Esp32BaseWeb::addPage("/irrigation/plans","计划",plans) &&
        Esp32BaseWeb::addPage("/irrigation/records","记录",records) &&
        Esp32BaseWeb::addPage("/irrigation/settings","设备设置",settings) &&
        Esp32BaseWeb::addRoute("/irrigation",Esp32BaseWeb::METHOD_POST,overview) &&
        Esp32BaseWeb::addRoute("/irrigation/manual",Esp32BaseWeb::METHOD_GET,manual) &&
        Esp32BaseWeb::addRoute("/irrigation/manual",Esp32BaseWeb::METHOD_POST,manual) &&
        Esp32BaseWeb::addRoute("/irrigation/plans",Esp32BaseWeb::METHOD_POST,plans) &&
        Esp32BaseWeb::addRoute("/irrigation/zones",Esp32BaseWeb::METHOD_GET,zones) &&
        Esp32BaseWeb::addRoute("/irrigation/zones",Esp32BaseWeb::METHOD_POST,zones) &&
        Esp32BaseWeb::addRoute("/irrigation/events",Esp32BaseWeb::METHOD_GET,events) &&
        Esp32BaseWeb::addRoute("/irrigation/zones/learning",Esp32BaseWeb::METHOD_GET,zoneLearning) &&
        Esp32BaseWeb::addRoute("/irrigation/zones/learning",Esp32BaseWeb::METHOD_POST,zoneLearning) &&
        Esp32BaseWeb::addApi("/irrigation/api/status",statusApi) &&
        Esp32BaseWeb::addApi("/irrigation/api/flow-history",flowHistoryApi);
}
void IrrigationWeb::overview() {
    if(Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if(!Esp32BaseWeb::checkPostAllowed("irrigation_stop")) return;
        redirectResult("/irrigation",actionIs("stop") && g_app->stopWatering()); return;
    }
    const WateringStatus watering = g_app->wateringStatus();
    if (watering.active) {
        activeTask();
        return;
    }
    if (!Esp32BaseWeb::checkAuth()) return;
    Esp32BaseWeb::sendHeader("智能浇水");
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeStyle);
    const AutomaticWateringState automatic = g_app->automaticWateringState();
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    const WateringScheduler::TimeState schedulerTime = g_app->schedulerTimeState();
    const bool timeTrusted = now.synced && schedulerTime == WateringScheduler::TimeState::Ready;
    const bool storageFault = g_app->recordStorageFault() || g_app->eventStorageFault() ||
                              g_app->schedulerStorageFault() || g_app->checkpointStorageFault();
    const IrrigationEvents::ConditionDisplayState rtcCondition =
        g_app->eventConditionState(1);
    const bool rtcUnavailable =
        rtcCondition == IrrigationEvents::ConditionDisplayState::Active ||
        rtcCondition == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery;
    const IrrigationConfig* config = g_app->configuration();
    bool hasEnabledZone = false;
    if (config) {
        for (const ZoneConfig& zone : config->zones) {
            if (zone.enabled) hasEnabledZone = true;
        }
    }
    const NextAutomaticWatering next = g_app->nextAutomaticWatering();
    LatestRecordContext latest;
    if (!g_app->recordStorageFault()) {
        g_app->readLatestWateringRecords(0, 1, collectLatestRecord, &latest);
    }
    char value[96]{};
    char secondary[96]{};

    char result[12]{};
    if (getParam("result", result, sizeof(result))) {
        if (std::strcmp(result, "ok") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "操作已完成");
        } else if (std::strcmp(result, "error") == 0) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "操作失败",
                                     "请检查设备时间和当前状态后重试。");
        }
    }

    const char* heroTone = "";
    const char* heroEyebrow = "当前状态";
    const char* heroTitle = "当前没有浇水";
    const char* heroDescription = "自动计划会按设定时间运行，也可以随时手动开始。";
    const char* heroHref = nullptr;
    const char* heroAction = "手动浇水";
    if (!hasEnabledZone) {
        heroDescription = "请先启用实际安装的水路，再开始浇水或配置计划。";
        heroHref = "/irrigation/zones";
        heroAction = "设置水路";
    }
    if (!g_app->businessReady()) {
        heroTone = " danger";
        const IrrigationConfigStore::LoadResult loadResult =
            g_app->configurationLoadResult();
        if (loadResult == IrrigationConfigStore::LoadResult::StorageUnavailable) {
            heroTitle = "设备存储不可用";
            heroDescription = "新设备首次烧录后可能需要初始化文件系统。全部输出已保持关闭。确认设备中没有需要保留的数据后，请到系统工具格式化 LittleFS；如果设备此前已经使用过，请勿直接格式化。";
        } else if (loadResult == IrrigationConfigStore::LoadResult::InvalidConfig) {
            heroTitle = "灌溉配置需要重新建立";
            heroDescription = "当前配置结构不兼容或配置文件没有有效副本，全部输出已保持关闭。如需保留现有数据，请勿直接格式化；完成备份后再到系统工具格式化 LittleFS 并重新配置。";
        } else if (loadResult == IrrigationConfigStore::LoadResult::WriteFailed) {
            heroTitle = "灌溉配置无法保存";
            heroDescription = "文件系统可以读取，但配置写入或校验失败，全部输出已保持关闭。请先查看系统状态和日志，不要直接格式化。";
        } else {
            heroTitle = "灌溉功能未就绪";
            heroDescription = "启动检查未能完成，全部输出已保持关闭。请查看系统状态和日志，不要直接格式化。";
        }
        heroHref = "/esp32base/system";
        heroAction = "打开系统工具";
    } else if (g_app->schedulerStorageFault()) {
        heroTone = " danger";
        heroTitle = "自动浇水暂不可用";
        heroDescription = "调度状态无法可靠保存；手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    } else if (schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        heroTone = " warn";
        heroTitle = "设备时间异常，自动浇水已停止";
        heroDescription = "检测到 RTC 时间明显倒退，等待 NTP 校时后自动恢复判断。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (!timeTrusted) {
        heroTone = " warn";
        heroTitle = "设备时间尚未就绪";
        heroDescription = "自动计划暂时不会运行，手动浇水仍可使用。";
        heroHref = "/esp32base";
        heroAction = "查看时间状态";
    } else if (storageFault) {
        heroTone = " warn";
        heroTitle = "部分数据存储异常";
        heroDescription = "请查看下方具体说明；记录写入故障会阻止新的浇水任务。";
        heroHref = "/esp32base";
        heroAction = "查看系统状态";
    }
    const char* defaultHeroTone = heroTone;
    const char* defaultHeroTitle = heroTitle;
    const char* defaultHeroDescription = heroDescription;
    const char* defaultHeroHref = heroHref;
    const char* defaultHeroAction = heroAction;
    const bool flowAlarm = g_app->businessReady() && g_app->unexpectedFlowAlarm();
    if (flowAlarm) {
        heroTone = " danger";
        heroTitle = "关阀后水流异常";
        heroDescription = "水泵和全部阀门均已关闭，但仍检测到水流。请检查阀门、管路或流量计。";
    }
    Esp32BaseWeb::sendChunk("<section class='home-hero");
    Esp32BaseWeb::sendChunk(heroTone);
    Esp32BaseWeb::sendChunk("' id='home-hero' data-flow-alarm='");
    html(flowAlarm ? "1" : "0");
    html("' data-default-tone='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroTone);
    Esp32BaseWeb::sendChunk("' data-default-title='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroTitle);
    Esp32BaseWeb::sendChunk("' data-default-description='");
    Esp32BaseWeb::writeHtmlEscaped(defaultHeroDescription);
    Esp32BaseWeb::sendChunk("' data-rtc-unavailable='");
    Esp32BaseWeb::sendChunk(rtcUnavailable ? "1" : "0");
    Esp32BaseWeb::sendChunk("'><div><span class='home-eyebrow'>");
    Esp32BaseWeb::writeHtmlEscaped(heroEyebrow);
    Esp32BaseWeb::sendChunk("</span><h1 id='home-hero-title'>");
    Esp32BaseWeb::writeHtmlEscaped(heroTitle);
    Esp32BaseWeb::sendChunk("</h1><p id='home-hero-description'>");
    Esp32BaseWeb::writeHtmlEscaped(heroDescription);
    if (watering.active) {
        Esp32BaseWeb::sendChunk(" · ");
        Esp32BaseWeb::writeHtmlEscaped(wateringStateName(watering.state));
        Esp32BaseWeb::sendChunk(watering.flowEstablished ? " · 水流正常" : " · 正在等待水流");
    }
    Esp32BaseWeb::sendChunk("</p><span id='home-flow-monitor' class='home-monitor");
    if (flowAlarm) Esp32BaseWeb::sendChunk(" danger");
    Esp32BaseWeb::sendChunk("'>");
    if (flowAlarm) {
        const uint16_t observedSec =
            g_app->unexpectedFlowObservedWindowSec();
        const uint32_t pulseCount =
            g_app->unexpectedFlowObservedPulseCount();
        char estimatedFlow[20]{};
        IrrigationConfigRules::formatLitersPerMinute(
            g_app->unexpectedFlowEstimatedMlPerMinute(),
            estimatedFlow,
            sizeof(estimatedFlow));
        Esp32BaseWeb::sendChunk("近 ");
        sendUnsigned(observedSec == 0 ? 1 : observedSec);
        Esp32BaseWeb::sendChunk(" 秒检测到 ");
        sendUnsigned(pulseCount);
        Esp32BaseWeb::sendChunk(" 个水流脉冲 · 估算平均流量 ");
        Esp32BaseWeb::writeHtmlEscaped(estimatedFlow);
        Esp32BaseWeb::sendChunk(" L/min");
    } else if (g_app->unexpectedFlowObservationReady()) {
        Esp32BaseWeb::sendChunk("关阀后水流监测已开启");
    } else {
        Esp32BaseWeb::sendChunk("关阀后水流监测中");
    }
    Esp32BaseWeb::sendChunk("</span></div><div class='home-hero-side'><div id='home-clock' class='home-clock");
    if (!timeTrusted) Esp32BaseWeb::sendChunk(" pending");
    if (rtcUnavailable) Esp32BaseWeb::sendChunk(" has-warning");
    Esp32BaseWeb::sendChunk("'");
    if (timeTrusted) {
        Esp32BaseWeb::sendChunk(" data-epoch='");
        sendUnsigned(now.epochSec);
        Esp32BaseWeb::sendChunk("'");
    }
    Esp32BaseWeb::sendChunk("><b id='home-clock-time' class='home-clock-time'>");
    if (timeTrusted && Esp32BaseTime::formatEpoch(now.epochSec, value, sizeof(value), "%H:%M:%S")) {
        Esp32BaseWeb::writeHtmlEscaped(value);
    } else {
        Esp32BaseWeb::sendChunk("尚未就绪");
    }
    Esp32BaseWeb::sendChunk("</b><span class='home-clock-date'><span id='home-clock-date'>");
    if (timeTrusted && formatChineseDate(now.epochSec, value, sizeof(value))) {
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</span>");
        Esp32BaseWeb::sendChunk(now.source == Esp32BaseTime::SOURCE_NTP ? " · NTP 校时" : " · RTC 时间");
    } else {
        Esp32BaseWeb::sendChunk("等待 RTC 或 NTP 提供可信时间");
        Esp32BaseWeb::sendChunk("</span>");
    }
    Esp32BaseWeb::sendChunk("</span>");
    if (rtcUnavailable) {
        Esp32BaseWeb::sendChunk("<a class='home-clock-warning' href='#conditions'>硬件时钟不可用 · 断网后计划可能暂停</a>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::sendChunk("<span id='home-default-action' class='home-action");
    if (flowAlarm) Esp32BaseWeb::sendChunk(" hidden");
    Esp32BaseWeb::sendChunk("'>");
    if (defaultHeroHref) {
        Esp32BaseWeb::sendChunk("<a class='btnlink info' href='");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroHref);
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroAction);
        Esp32BaseWeb::sendChunk("</a>");
    } else if (config && hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<a class='btnlink info' href='/irrigation/manual'>");
        Esp32BaseWeb::writeHtmlEscaped(defaultHeroAction);
        Esp32BaseWeb::sendChunk("</a>");
    }
    Esp32BaseWeb::sendChunk("</span><a id='home-alarm-action' class='home-action btnlink info");
    if (!flowAlarm) Esp32BaseWeb::sendChunk(" hidden");
    Esp32BaseWeb::sendChunk("' href='#conditions'>查看异常说明</a></div></section>");
    const bool heroShowsOtherPriority = watering.active || g_app->unexpectedFlowAlarm();
    if (heroShowsOtherPriority && g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "自动浇水暂不可用",
                                 "调度状态无法可靠保存；当前或手动浇水不受影响。");
    } else if (heroShowsOtherPriority && schedulerTime == WateringScheduler::TimeState::RtcRollback) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间异常",
                                 "自动计划已停止，等待 NTP 校时后恢复判断。");
    } else if (heroShowsOtherPriority && !timeTrusted) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备时间尚未就绪",
                                 "自动计划暂时不会运行，手动浇水仍可使用。");
    }
    if (heroShowsOtherPriority && storageFault && !g_app->schedulerStorageFault()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "部分数据存储异常",
                                 "请在当前浇水结束后查看系统状态。");
    }
    conditions();
    Esp32BaseWeb::beginPanel("每日浇水");
    const uint32_t day = selectedDay();
    if (day) dateNav(day);
    renderDay(day);
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendChunk("<div class='home-grid'>");

    Esp32BaseWeb::sendChunk("<section class='home-card'><div class='home-card-head'><h2>下一次自动浇水</h2>");
    if (automatic.mode == AutomaticWateringMode::Enabled) {
        Esp32BaseWeb::sendChunk("<span class='tag ok'>自动浇水正常</span></div>");
    } else {
        Esp32BaseWeb::sendChunk("<span class='tag warn'>自动浇水已暂停</span></div>");
    }
    if (automatic.mode == AutomaticWateringMode::PausedIndefinitely) {
        Esp32BaseWeb::sendChunk("<div class='home-main'>等待你手动恢复</div><p class='home-sub'>暂停期间到点的计划不会执行，也不会补执行。</p>");
    } else {
        if (automatic.mode == AutomaticWateringMode::PausedUntil) {
            if (formatFriendlyDateTime(automatic.resumeAtEpoch, now.epochSec, value, sizeof(value)) &&
                formatFullDateTime(automatic.resumeAtEpoch, secondary, sizeof(secondary))) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>将在");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("自动恢复</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                if (!timeTrusted) Esp32BaseWeb::sendChunk("；设备时间恢复可信后才会判断是否到期");
                Esp32BaseWeb::sendChunk("</p>");
            }
        }
        if (next.status == NextAutomaticWateringStatus::Available &&
            formatFriendlyDateTime(next.scheduledEpoch, now.epochSec, value, sizeof(value)) &&
            formatFullDateTime(next.scheduledEpoch, secondary, sizeof(secondary))) {
            const WateringPlan* nextPlan =
                config && next.planId != 0 && next.planId <= config->plans.size()
                    ? &config->plans[next.planId - 1U]
                    : nullptr;
            if (automatic.mode == AutomaticWateringMode::Enabled) {
                Esp32BaseWeb::sendChunk("<div class='home-main'>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
                Esp32BaseWeb::writeHtmlEscaped(secondary);
                Esp32BaseWeb::sendChunk("</p>");
            }
            Esp32BaseWeb::sendChunk("<div class='home-plan'><span>");
            Esp32BaseWeb::sendChunk(automatic.mode == AutomaticWateringMode::Enabled ? "执行计划" : "恢复后的计划");
            Esp32BaseWeb::sendChunk("</span><b>");
            const char* nextPlanName = planNameById(config, next.planId);
            if (nextPlanName) {
                Esp32BaseWeb::writeHtmlEscaped(nextPlanName);
            } else {
                Esp32BaseWeb::sendChunk("计划 ");
                sendUnsigned(next.planId);
            }
            Esp32BaseWeb::sendChunk("</b></div>");
            uint8_t nextZoneCount = 0;
            uint32_t nextTotalMinutes = 0;
            if (nextPlan) {
                for (uint8_t index = 0;
                     index < nextPlan->zoneDurationMinutes.size();
                     ++index) {
                    if (!config->zones[index].enabled ||
                        nextPlan->zoneDurationMinutes[index] == 0) {
                        continue;
                    }
                    ++nextZoneCount;
                    nextTotalMinutes += nextPlan->zoneDurationMinutes[index];
                }
            }
            Esp32BaseWeb::sendChunk("<div class='home-facts'><div class='home-fact'><span>执行内容</span><b>");
            sendUnsigned(nextZoneCount);
            Esp32BaseWeb::sendChunk(" 个水路 · 预计 ");
            sendUnsigned(nextTotalMinutes);
            Esp32BaseWeb::sendChunk(" 分钟</b></div>");
            if (nextPlan && nextZoneCount != 0) {
                Esp32BaseWeb::sendChunk("<div class='home-fact'><span>水路安排</span><b>");
                uint8_t emitted = 0;
                for (uint8_t index = 0;
                     index < nextPlan->zoneDurationMinutes.size() && emitted < 3;
                     ++index) {
                    const uint16_t duration =
                        nextPlan->zoneDurationMinutes[index];
                    if (!config->zones[index].enabled || duration == 0) continue;
                    if (emitted != 0) Esp32BaseWeb::sendChunk(" · ");
                    Esp32BaseWeb::writeHtmlEscaped(
                        config->zones[index].name.data());
                    Esp32BaseWeb::sendChunk(" ");
                    sendUnsigned(duration);
                    Esp32BaseWeb::sendChunk(" 分");
                    ++emitted;
                }
                if (nextZoneCount > emitted) {
                    Esp32BaseWeb::sendChunk(" · 另有 ");
                    sendUnsigned(nextZoneCount - emitted);
                    Esp32BaseWeb::sendChunk(" 个水路");
                }
                Esp32BaseWeb::sendChunk("</b></div>");
            }
            if (automatic.mode == AutomaticWateringMode::PausedUntil) {
                Esp32BaseWeb::sendChunk("<div class='home-fact'><span>下一次执行</span><b>");
                Esp32BaseWeb::writeHtmlEscaped(value);
                Esp32BaseWeb::sendChunk("</b></div>");
            }
            Esp32BaseWeb::sendChunk("</div>");
        } else if (next.status == NextAutomaticWateringStatus::NoEnabledPlans) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有开启自动执行的计划。设置计划和启动时间后，下一次浇水会显示在这里。</div>");
        } else if (next.status == NextAutomaticWateringStatus::RtcRollback) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间发生倒退，暂时无法计算下一次浇水。</div>");
        } else if (next.status == NextAutomaticWateringStatus::TimeUnavailable) {
            Esp32BaseWeb::sendChunk("<div class='home-empty'>设备时间尚未就绪，暂时无法计算下一次浇水。</div>");
        }
    }
    Esp32BaseWeb::sendChunk("<div class='home-card-actions'><a class='btnlink secondary' href='/irrigation/plans'>管理计划</a></div></section>");

