tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
    Esp32BaseWeb::sendChunk("<section id='home-recent-card' class='home-card");
    if (latest.found) {
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::sendChunk(recordOutcomeTone(latest.record.payload));
    }
    Esp32BaseWeb::sendChunk("'><div class='home-card-head'><h2>最近一次浇水</h2>");
    if (latest.found) {
        Esp32BaseWeb::sendChunk("<span class='tag ");
        Esp32BaseWeb::sendChunk(recordOutcomeTone(latest.record.payload));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(outcome(latest.record.payload));
        Esp32BaseWeb::sendChunk("</span>");
    } else {
        Esp32BaseWeb::sendChunk("<a class='btnlink compact secondary' href='/irrigation/records'>全部记录</a>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (g_app->recordStorageFault()) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>浇水记录存储异常，暂时无法读取最近记录。</div>");
    } else if (!latest.found) {
        Esp32BaseWeb::sendChunk("<div class='home-empty'>还没有浇水记录。第一次浇水执行结束后，无论完成、停止或失败，结果都会显示在这里。</div>");
    } else {
        const WateringRecordTotals totals = WateringRecordCodec::calculateTotals(
            latest.record.payload);
        Esp32BaseWeb::sendChunk("<div class='home-main'>");
        Esp32BaseWeb::writeHtmlEscaped(sourceName(latest.record.payload.source));
        const char* recordPlanName = planNameById(config, latest.record.payload.planId);
        if (recordPlanName) {
            Esp32BaseWeb::sendChunk(" · ");
            Esp32BaseWeb::writeHtmlEscaped(recordPlanName);
        }
        Esp32BaseWeb::sendChunk("</div><p class='home-sub'>");
        if (latest.record.payload.result == WateringResult::Incomplete) { epochText(latest.record.payload.startedEpoch); html(" · 中断时间未知"); }
        else sendRecordTimeRange(latest.record.timing);
        Esp32BaseWeb::sendChunk("</p><p class='home-outcome'>");
        sendRecordOutcomeSummary(latest.record.payload, config);
        Esp32BaseWeb::sendChunk("</p><div class='home-facts'><div class='home-fact'><span>执行目标</span><b>");
        const uint32_t latestTargetWaterMl = recordTargetWaterMl(latest.record.payload);
        if (latestTargetWaterMl != 0) sendCompactWaterVolume(latestTargetWaterMl);
        else { formatElapsed(totals.plannedDurationSec, value, sizeof(value)); Esp32BaseWeb::writeHtmlEscaped(value); }
        Esp32BaseWeb::sendChunk("</b></div><div class='home-fact'><span>实际浇水</span><b>");
        if (latest.record.payload.result == WateringResult::Incomplete) std::snprintf(value, sizeof(value), "未知");
        else formatElapsed(totals.actualWateringSec, value, sizeof(value));
        Esp32BaseWeb::writeHtmlEscaped(value);
        Esp32BaseWeb::sendChunk("</b></div><div class='home-fact'><span>估算用水量</span><b>");
        if (latest.record.payload.result == WateringResult::Incomplete) html("未知");
        else sendCompactWaterVolume(totals.estimatedWaterMl);
        Esp32BaseWeb::sendChunk("</b></div></div><div class='home-card-actions'><a class='btnlink info' href='/irrigation/records?id=");
        sendUnsigned(latest.record.recordId);
        Esp32BaseWeb::sendChunk("'>查看完整记录</a><a class='btnlink secondary' href='/irrigation/records'>全部记录</a></div>");
    }
    Esp32BaseWeb::sendChunk("</section></div>");

    const uint32_t checkpointEpoch = g_app->lastKnownAliveEpoch();
    const char* resetReason = Esp32BaseSystem::resetReason();
    if (now.synced && checkpointEpoch != 0 && now.bootStartEpochSec >= checkpointEpoch &&
        (std::strcmp(resetReason, "poweron") == 0 ||
         std::strcmp(resetReason, "brownout") == 0)) {
        char checkpointText[24]{};
        char bootText[24]{};
        char message[96]{};
        if (Esp32BaseTime::formatEpoch(checkpointEpoch, checkpointText,
                                       sizeof(checkpointText), "%Y-%m-%d %H:%M") &&
            Esp32BaseTime::formatEpoch(now.bootStartEpochSec, bootText,
                                       sizeof(bootText), "%Y-%m-%d %H:%M")) {
            std::snprintf(message, sizeof(message), "%s 至 %s；仅为可能范围，不是精确停电时间",
                          checkpointText, bootText);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "可能断电范围", message);
        }
    }
    Esp32BaseRecordStore::StoreStatus history{};
    g_app->readWateringRecordStoreStatus(history);
    html("<div class='muted' data-home-watch='idle' data-record-next='"); sendUnsigned(history.nextRecordId); html("'></div>");
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeScript);
    endPage();
}

void IrrigationWeb::manual() {
    const auto* c=g_app->configuration(); const bool post=Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST);
    WateringStartResult result=WateringStartResult::InvalidRequest;
    if(post) {
        if(!Esp32BaseWeb::checkPostAllowed("irrigation_manual")) return;
        if(c && paramIs("mode","volume")) {
            uint32_t zone=0; char liters[20]{}; uint32_t ml=0;
            if(uintParam("zone_id",1,BoardPins::kZoneCount,zone) && getParam("target_liters",liters,sizeof(liters)) &&
               IrrigationConfigRules::parseLitersPerMinute(liters,ml)) {
                WateringRequest request{}; request.source=WateringSource::Manual;
                request.targetMode=WateringTargetMode::Volume; request.purpose=WateringPurpose::Normal;
                request.stepCount=1; request.steps[0]={uint8_t(zone),uint32_t(c->runLimits.maximumZoneDurationMinutes)*60U,ml};
                result=g_app->startWatering(request);
            }
        } else if(c) {
            WateringRequest request{}; request.source=WateringSource::Manual; request.purpose=WateringPurpose::Normal;
            bool valid=true;
            for(size_t i=0;i<c->zones.size();++i) {
                if(!c->zones[i].enabled) continue;
                char name[12]; uint32_t seconds=0;
                std::snprintf(name,sizeof(name),"zone%u",unsigned(i+1));
                if(!uintParam(name,0,c->runLimits.maximumZoneDurationMinutes,seconds)) { valid=false; break; }
                seconds *= 60U;
                char extraName[16]; uint32_t extra = 0;
                std::snprintf(extraName, sizeof(extraName), "seconds%u", unsigned(i+1));
                if (Esp32BaseWeb::hasParam(extraName) && !uintParam(extraName, 0, 59, extra)) { valid=false; break; }
                seconds += extra;
                if (seconds > c->runLimits.maximumZoneDurationMinutes*60U) { valid=false; break; }
                if(seconds) request.steps[request.stepCount++]={uint8_t(i+1),seconds,0};
            }
            if(valid) result=g_app->startWatering(request);
        }
        if(result==WateringStartResult::Started) { Esp32BaseWeb::redirectSeeOther("/irrigation"); return; }
    }
    if(!beginPage("手动浇水","只影响本次操作，不修改计划")) return;
    if(post) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,"未能开始浇水",
        result==WateringStartResult::Busy?"设备正在执行其他任务，请先查看首页。":
        result==WateringStartResult::PreviousResultPending?"上一任务正在保存结果，请检查记录存储。":
        result==WateringStartResult::NotReady?"设备或任务记录未就绪，请查看首页提示。":"请检查水路、时长和水量输入。");
    if(!c) { html("<p>设备配置未就绪。</p>"); endPage(); return; }
    bool hasZones=false; for(const auto& z:c->zones) hasZones|=z.enabled;
    if(!hasZones || g_app->wateringActive()) { html("<p>请先启用水路，并等待当前任务结束。</p><a href='/irrigation'>返回首页</a>"); endPage(); return; }
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeStyle);
    const IrrigationConfig* config = c;
    const bool hasEnabledZone = hasZones;
    html("<p><a class='btnlink secondary' href='/irrigation'>返回首页</a></p>");
    if (paramIs("mode", "volume")) {
        html("<p><a class='btnlink secondary' href='/irrigation/manual'>返回按时间浇水</a></p>");
        Esp32BaseWeb::beginPanel("按水量浇水");
        html("<form id='single-output-form' method='post' action='/irrigation/manual' data-max-duration-seconds='");
        sendUnsigned(c->runLimits.maximumZoneDurationMinutes*60U);
        html("' data-max-volume-liters='"); sendUnsigned(c->runLimits.maximumSingleOutputLiters);
        html("' data-target-liters='"); char targetLiters[20]{};
        if(post && getParam("target_liters",targetLiters,sizeof(targetLiters))) escaped(targetLiters);
        html("' onsubmit='return submitSingleOutput(this)'><input type='hidden' name='mode' value='volume'><section class='single-output-step'><h3 class='single-output-step-title'>选择水路</h3><div class='single-output-zones'>");
        bool first=true;
        uint32_t chosen=0; uintParam("zone_id",1,BoardPins::kZoneCount,chosen);
        for (const auto& zone : c->zones) {
            if (!zone.enabled) continue;
            uint32_t flow=0;
            FlowMonitor::pulseRateX10000ToFlowMlPerMinute(zone.baselinePulseRateX10000,c->flowMeter.pulsesPerLiterX100,flow);
            html("<label class='single-output-option'><input type='radio' name='zone_id' value='"); sendUnsigned(zone.id);
            html("' data-flow='"); sendUnsigned(flow); html("'");
            if (chosen ? chosen==zone.id : first) html(" checked");
            html("><span class='single-output-zone-card'><span class='single-output-zone-check'>✓</span><b>"); escaped(zone.name.data());
            html("</b><small>水路 "); sendUnsigned(zone.id); html("</small></span></label>"); first=false;
        }
        IrrigationWebAssets::send(IrrigationWebAssets::Asset::SingleOutputForm);
        Esp32BaseWeb::endPanel();
    } else {
    if (config && hasEnabledZone) {
        Esp32BaseWeb::sendChunk("<section class='panel'><h2>手动浇水</h2><p class='muted'>可以从计划填入时长，也可以直接设置；最终只按这里提交的时长执行，不会修改计划。</p><form id='manual-form' method='post' action='/irrigation/manual' onsubmit='return submitManualWatering(this)'><input type='hidden' name='action' value='start_zones'>");
        bool hasPlan = false;
        for (const WateringPlan& plan : config->plans) if (plan.configured) hasPlan = true;
        Esp32BaseWeb::sendChunk("<div class='manual-template'><div class='manual-template-head'><h3>快速填入计划</h3><a href='/irrigation/plans'>管理计划</a></div>");
        if (hasPlan) {
            Esp32BaseWeb::sendChunk("<div class='manual-template-list'>");
            for (const WateringPlan& plan : config->plans) {
                if (!plan.configured) continue;
                uint16_t activeZoneCount = 0;
                uint32_t totalMinutes = 0;
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                    ++activeZoneCount;
                    totalMinutes += plan.zoneDurationMinutes[index];
                }
                Esp32BaseWeb::sendChunk("<button type='button' class='manual-template-card' data-plan-name='");
                Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
                Esp32BaseWeb::sendChunk("' data-durations='");
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (index != 0) Esp32BaseWeb::sendChunk(",");
                    sendUnsigned(plan.zoneDurationMinutes[index]);
                }
                Esp32BaseWeb::sendChunk("'");
                if (activeZoneCount == 0) Esp32BaseWeb::sendChunk(" disabled");
                Esp32BaseWeb::sendChunk("><b>");
                Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
                Esp32BaseWeb::sendChunk("</b><span>");
                bool emittedZone = false;
                for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                    if (!config->zones[index].enabled || plan.zoneDurationMinutes[index] == 0) continue;
                    if (emittedZone) Esp32BaseWeb::sendChunk(" · ");
                    Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                    Esp32BaseWeb::sendChunk(" ");
                    sendUnsigned(plan.zoneDurationMinutes[index]);
                    Esp32BaseWeb::sendChunk("分");
                    emittedZone = true;
                }
                if (!emittedZone) Esp32BaseWeb::sendChunk("当前无可执行水路");
                Esp32BaseWeb::sendChunk("</span><small>");
                sendUnsigned(activeZoneCount);
                Esp32BaseWeb::sendChunk(" 路 · 共 ");
                sendUnsigned(totalMinutes);
                Esp32BaseWeb::sendChunk(" 分钟</small></button>");
            }
            Esp32BaseWeb::sendChunk("</div>");
        } else {
            Esp32BaseWeb::sendChunk("<div class='manual-template-empty'>还没有可用计划，可以直接设置下方各水路时长。</div>");
        }
        Esp32BaseWeb::sendChunk("</div>");
        Esp32BaseWeb::sendChunk("<div class='manual-grid'>");
        for (uint8_t index = 0; index < config->zones.size(); ++index) {
            if (!config->zones[index].enabled) continue;
            Esp32BaseWeb::sendChunk("<div class='manual-zone'><label>");
            Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
            Esp32BaseWeb::sendChunk("</label><input class='manual-duration' data-zone-index='"); sendUnsigned(index);
            Esp32BaseWeb::sendChunk("' type='number' min='0' max='"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk("' name='zone"); sendUnsigned(index + 1U);
            Esp32BaseWeb::sendChunk("' value='");
            char field[12], value[16]{}; std::snprintf(field,sizeof(field),"zone%u",unsigned(index+1));
            if (post && getParam(field,value,sizeof(value))) escaped(value); else html("0");
            html("' inputmode='numeric'><span>分钟</span></div>");
        }
        html("</div><details><summary>精确到秒</summary><div class='fieldgrid'>");
        for (size_t i=0;i<config->zones.size();++i) {
            if (!config->zones[i].enabled) continue;
            html("<p class='field med'><label>"); escaped(config->zones[i].name.data());
            html(" · 额外秒数</label><input class='manual-extra-seconds' type='number' min='0' max='59' name='seconds"); sendUnsigned(i+1);
            html("' value='"); char field[16], value[12]{}; std::snprintf(field,sizeof(field),"seconds%u",unsigned(i+1));
            if (post && getParam(field,value,sizeof(value))) escaped(value); else html("0");
            html("'></p>");
        }
        html("</div></details>");
        Esp32BaseWeb::sendChunk("<div class='manual-summary'><b id='manual-summary'>尚未选择水路</b><span id='manual-template-note'>每条水路范围 0～"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk(" 分钟，0 表示本次不执行。</span></div><div class='actions'><button id='manual-clear' type='button' class='secondary'>全部清零</button><a class='btnlink secondary' href='/irrigation'>取消</a><input id='manual-submit' type='submit' value='确认并开始浇水' disabled></div></form></section>");
    } else if (config) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "还没有启用水路", "请先到水路页面启用实际安装的水路。");
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink info' href='/irrigation/zones'>前往水路设置</a></div>");
    }
        html("<details><summary>其他浇水方式</summary><p><a class='btnlink secondary' href='/irrigation/manual?mode=volume'>单条水路按水量浇水</a></p></details>");
    }
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeScript);
    endPage();
}

