tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
        for (const WateringPlan& savedPlan : config->plans) {
            WateringPlan plan=savedPlan;
            const bool retry=failed && postedPlan==plan.id && actionIs("save");
            uint32_t formRevision=config->revision;
            if(retry) {
                getParam("name",plan.name.data(),plan.name.size());
                plan.scheduleEnabled=Esp32BaseWeb::hasParam("schedule_enabled");
                uintParam("revision",1,UINT32_MAX,formRevision);
                for(size_t i=0;i<plan.startMinutes.size();++i) {
                    char field[12],value[8]{}; std::snprintf(field,sizeof(field),"time%u",unsigned(i+1));
                    if(getParam(field,value,sizeof(value))) parseStartMinute(value,plan.startMinutes[i]);
                }
                for(size_t i=0;i<plan.zoneDurationMinutes.size();++i) {
                    char field[12];uint32_t value=0;std::snprintf(field,sizeof(field),"zone%u",unsigned(i+1));
                    if(uintParam(field,0,config->runLimits.maximumZoneDurationMinutes,value)) plan.zoneDurationMinutes[i]=value;
                }
            }
            if (!plan.configured && static_cast<int>(plan.id - 1U) != firstAvailable) continue;
            Esp32BaseWeb::sendChunk("<dialog id='plan-"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal plan-modal' data-eb-light-dismiss='1'><h2>");
            Esp32BaseWeb::writeHtmlEscaped(plan.configured ? "编辑浇水计划" : "新增浇水计划");
            html("</h2>");
            if(retry) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,"未保存修改",formRevision!=config->revision ? "配置已在其他页面更新，请关闭表单并刷新后重试。" : g_app->configurationError());
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(formRevision);
            Esp32BaseWeb::sendChunk("'><div class='plan-editor'><section class='plan-group'><h3>基本信息</h3><small>计划名称用于运行和浇水记录；自动执行关闭后仍可填入手动浇水时长。</small><div class='plan-basic'><p class='field'><label>计划名称</label><input type='text' name='name' maxlength='63' required value='");
            Esp32BaseWeb::writeHtmlEscaped(plan.name.data());
            Esp32BaseWeb::sendChunk("'></p><div class='plan-switch'><label><input type='checkbox' name='schedule_enabled' value='1' ");
            if (plan.scheduleEnabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 自动执行</label><small>仅控制定时执行；关闭后仍可在手动浇水页作为手动浇水模板。</small></div></div></section><section class='plan-group'><h3>自动执行时间</h3><small>每天最多执行 4 次；留空表示不使用。点击“清除”可删除已经设置的时间。</small><div class='plan-times'>");
            for (uint8_t index = 0; index < plan.startMinutes.size(); ++index) {
                Esp32BaseWeb::sendChunk("<div class='plan-time'><label>启动时间 "); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("</label><div class='plan-time-row'><input type='time' name='time"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("' value='");
                if (plan.startMinutes[index] != kUnusedStartMinute) { char time[8]; std::snprintf(time, sizeof(time), "%02u:%02u", plan.startMinutes[index] / 60U, plan.startMinutes[index] % 60U); Esp32BaseWeb::sendChunk(time); }
                Esp32BaseWeb::sendChunk("'><button type='button' class='secondary clear-time' onclick=\"this.previousElementSibling.value=''\">清除</button></div></div>");
            }
            Esp32BaseWeb::sendChunk("</div></section><section class='plan-group'><h3>各水路浇水时长</h3><small>这里只显示已启用水路；设置为 0 分钟表示本计划不浇该水路。</small><div class='plan-zones'>");
            for (uint8_t index = 0; index < plan.zoneDurationMinutes.size(); ++index) {
                if (!config->zones[index].enabled) continue;
                Esp32BaseWeb::sendChunk("<p class='plan-zone'><label>"); Esp32BaseWeb::writeHtmlEscaped(config->zones[index].name.data());
                Esp32BaseWeb::sendChunk("</label><input type='number' name='zone"); sendUnsigned(index + 1U);
                Esp32BaseWeb::sendChunk("' min='0' max='"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk("' value='"); sendUnsigned(plan.zoneDurationMinutes[index]);
                Esp32BaseWeb::sendChunk("'><small>单位：分钟，范围 0～"); sendUnsigned(config->runLimits.maximumZoneDurationMinutes); Esp32BaseWeb::sendChunk("。</small></p>");
            }
            Esp32BaseWeb::sendChunk("</div></section></div><div class='actions plan-form-actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存计划'></div></form>");
            if (plan.configured) { Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\"><input type='hidden' name='action' value='delete'><input type='hidden' name='plan_id' value='"); sendUnsigned(plan.id); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(formRevision); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='删除计划'></div></form>"); }
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    if(failed && postedPlan) { html("<script>var d=document.getElementById('plan-");sendUnsigned(postedPlan);html("');if(d)d.showModal();</script>"); }
    endPage();
}

void IrrigationWeb::records() {
    if(!beginPage("浇水记录","实际时长为主，估算水量为辅"))return;
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::RecordsStyle);
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::EventsStyle);
    HistoryRows q{};char date[12]{},result[16]{};if(getParam("date",date,sizeof(date)) && date[0])q.day=selectedDay();uintParam("zone",1,6,q.zone);uintParam("offset",0,UINT32_MAX-20,q.offset);getParam("result",result,sizeof(result));q.result=result;
    html("<form method='get' class='event-filter'><label>日期<input type='date' name='date' value='");escaped(date);html("'></label><label>水路<select name='zone'><option value=''>全部水路</option>");
    for(size_t i=0;i<BoardPins::kZoneCount;++i){html("<option value='");sendUnsigned(i+1);html("'");if(q.zone==i+1)html(" selected");html(">");sendZoneName(g_app->configuration(),i);html("</option>");}
    html("</select></label><label>结果<select name='result'><option value=''>全部结果</option><option value='issues'");if(!strcmp(result,"issues"))html(" selected");html(">停止、异常或不完整</option></select></label><button>筛选</button><a href='/irrigation/records'>清除</a></form><section class='panel'><h2>历史记录</h2><div class='tablewrap'><table class='record-table'><thead><tr><th>开始时间</th><th>浇水任务</th><th>执行水路</th><th>执行结果</th><th>实际 / 目标</th><th>估算用水量</th><th>操作</th></tr></thead><tbody>");
    Esp32BaseRecordStore::StoreStatus state{};const bool ok=g_app->readWateringRecordStoreStatus(state)&&state.ready&&(state.recordCount==0||g_app->readLatestWateringRecords(0,state.recordCount,historyRow,&q));
    html("</tbody></table></div>");
    if(!ok)html("<p class='notice warn'>记录读取失败，不能据此判断没有浇水。</p>");else if(!q.shown)html("<p>当前条件下暂无浇水记录。</p>");html("</section>");
    if(q.offset || q.matched>q.offset+q.shown){html("<nav class='actions'>");for(int d=-1;d<=1;d+=2){if(d<0&&!q.offset)continue;if(d>0&&q.matched<=q.offset+q.shown)continue;html("<a class='btnlink secondary' href='?date=");escaped(date);html("&zone=");sendUnsigned(q.zone);html("&result=");escaped(result);html("&offset=");sendUnsigned(d<0?(q.offset>20?q.offset-20:0):q.offset+20);html("'>");html(d<0?"上一页":"下一页");html("</a>");}html("</nav>");}
    if(state.oldestRecordId>1)html("<p class='muted'>本地历史按预算滚动保留，较早记录可能已淘汰。</p>");
    html("<section class='panel'><h2>设备计划未执行</h2><p class='muted'>按日期查看，涵盖全部水路。</p><div class='tablewrap'><table class='event-table'><thead><tr><th>时间</th><th>等级</th><th>事件</th><th>说明</th></tr></thead><tbody>");IrrigationEvents::EventStatus status{};AuditRows a{};a.day=q.day;a.skippedOnly=true;
    const bool auditReadable=g_app->readEventStatus(status) && status.eventStore.ready &&
        (status.eventStore.recordCount==0 || g_app->readLatestEvents(0,status.eventStore.recordCount,auditRow,&a));
    html("</tbody></table></div>");
    if(!auditReadable) html("<p class='notice warn'>计划未执行记录暂时无法读取。</p>");
    else if(!a.shown)html("<p class='muted'>当前日期条件下没有已记录的跳过事项；这不证明离线或停机时段均已执行。</p>");html("</section><p><a href='/irrigation/events'>操作与设备异常历史 ›</a></p>");
    uint32_t detailId=0;
    if (uintParam("id",1,UINT32_MAX,detailId)) {
        StoredWateringRecord detail{};
        if (g_app->readWateringRecordById(detailId,detail)==Esp32BaseRecordStore::RecordReadResult::Found) {
            sendRecordDetailDialog(detail,g_app->configuration(),"record-direct-detail-");
            html("<script>document.getElementById('record-direct-detail-"); sendUnsigned(detailId); html("').showModal();</script>");
        } else Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,"找不到该浇水记录","记录无法读取或已被滚动淘汰。");
    }
    endPage();
}
void IrrigationWeb::events() {
    if(!beginPage("操作与设备异常历史","查看影响计划和水路的必要变化"))return;
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::EventsStyle);
    html("<p><a href='/irrigation/records'>‹ 浇水记录</a></p><section class='panel'><h2>事件记录</h2><div class='tablewrap'><table class='event-table'><thead><tr><th>时间</th><th>等级</th><th>事件</th><th>说明</th></tr></thead><tbody>");IrrigationEvents::EventStatus status{};AuditRows q{};uintParam("offset",0,UINT32_MAX-20,q.offset);
    const bool readable=g_app->readEventStatus(status) && status.eventStore.ready &&
        (!status.eventStore.recordCount || g_app->readLatestEvents(0,status.eventStore.recordCount,auditRow,&q));
    html("</tbody></table></div>");
    if(!readable) html("<p>历史暂时无法读取，不能据此判断没有发生过事项。</p>");
    else if(!q.shown) html("<p>暂无历史事项。</p>");
    html("</section>");
    if(q.offset) { html("<a class='btnlink secondary' href='?offset="); sendUnsigned(q.offset>20?q.offset-20:0); html("'>上一页</a> "); }
    if(q.matched>q.offset+q.shown){html("<a href='?offset=");sendUnsigned(q.offset+20);html("'>更早记录 ›</a>");}endPage();
}
void IrrigationWeb::zones() {
    bool failed=false; uint32_t postedZone=0;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zones")) return;
        uintParam("zone_id",1,BoardPins::kZoneCount,postedZone);
        if(actionIs("save") && saveZoneFromRequest()) { redirectResult("/irrigation/zones",true); return; }
        failed=true;
    }
    if (!beginPage("水路设置", "启用实际安装的水路，并学习各水路的基准流量")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".zone-meter{display:flex;align-items:center;justify-content:space-between;gap:16px}"
        ".zone-meter-main{display:flex;align-items:baseline;flex-wrap:wrap;gap:8px}"
        ".zone-meter-label{margin:0;color:var(--eb-muted);font-size:13px}"
        ".zone-meter-value{display:flex;align-items:baseline;gap:6px;color:var(--eb-primary);line-height:1}"
        ".zone-meter-number{font-size:18px;font-weight:650}"
        ".zone-meter-unit{font-size:14px;color:var(--eb-muted)}"
        ".zone-table th{font-weight:600}.zone-table td{font-weight:400}"
        ".zone-table .tag{font-weight:500}"
        ".zone-table .btnlink{font-weight:500}"
        "@media(max-width:760px){.zone-meter{align-items:stretch;flex-direction:column;gap:10px}.zone-meter .btnlink{width:100%}}"
        "</style>");
    html("<p><a class='btnlink secondary' href='/irrigation/settings'>返回设备设置</a></p>");
    const IrrigationConfig* config = g_app->configuration();
    if (config) {
        char coefficient[20]{};
        IrrigationConfigRules::formatPulsesPerLiter(
            config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
        Esp32BaseWeb::beginPanel("水路列表");
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part zone-table'><thead><tr><th>水路</th><th>名称</th><th>启用状态</th><th>基准流量</th><th>操作</th></tr></thead><tbody>");
        for (const ZoneConfig& zone : config->zones) {
            char value[20]{};
            uint32_t flowMlPerMinute = 0;
            if (zone.baselinePulseRateX10000 != 0 &&
                FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
                    zone.baselinePulseRateX10000,
                    config->flowMeter.pulsesPerLiterX100,
                    flowMlPerMinute)) {
                IrrigationConfigRules::formatLitersPerMinute(
                    flowMlPerMinute, value, sizeof(value));
            }
            Esp32BaseWeb::sendChunk("<tr><td>水路 "); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("</td><td>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("</td><td><span class='tag ");
            Esp32BaseWeb::sendChunk(zone.enabled ? "ok'>已启用" : "'>未启用");
            Esp32BaseWeb::sendChunk("</span></td><td>");
            if (zone.baselinePulseRateX10000 == 0) Esp32BaseWeb::sendChunk("<span class='muted'>未设置</span>");
            else if (value[0] == '\0') Esp32BaseWeb::sendChunk("<span class='muted'>超出显示范围</span>");
            else { Esp32BaseWeb::writeHtmlEscaped(value); Esp32BaseWeb::sendChunk(" L/min（已设置）"); }
            Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><button type='button' class='btnlink info compact' onclick=\"document.getElementById('zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("').showModal()\">修改</button>");
            Esp32BaseWeb::sendChunk("<a class='btnlink ok compact' href='/irrigation/zones/learning?zone="); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::sendChunk(zone.enabled ? "学习基准流量" : "设置基准流量"); Esp32BaseWeb::sendChunk("</a>");
            Esp32BaseWeb::sendChunk("</div></td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
        Esp32BaseWeb::beginPanel("流量计维护");
        Esp32BaseWeb::sendChunk("<div class='zone-meter'><div class='zone-meter-main'><p class='zone-meter-label'>稳态流量系数</p><div class='zone-meter-value'><span class='zone-meter-number'>");
        Esp32BaseWeb::writeHtmlEscaped(coefficient);
        Esp32BaseWeb::sendChunk("</span><span class='zone-meter-unit'>P/L</span></div></div><a class='btnlink ok compact' href='/esp32base/app-config'>设置每升脉冲数</a></div>");
        Esp32BaseWeb::endPanel();
        for (const ZoneConfig& savedZone : config->zones) {
            ZoneConfig zone=savedZone;
            const bool retry=failed && postedZone==zone.id;
            uint32_t formRevision=config->revision;
            if(retry) {
                getParam("name",zone.name.data(),zone.name.size());
                zone.enabled=Esp32BaseWeb::hasParam("enabled");
                uintParam("revision",1,UINT32_MAX,formRevision);
            }
            Esp32BaseWeb::sendChunk("<dialog id='zone-"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("' class='panel eb-modal' data-eb-light-dismiss='1'><h2>修改水路 "); sendUnsigned(zone.id);
            html("</h2>");
            if(retry) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,"未保存修改",formRevision!=config->revision ? "配置已在其他页面更新，请关闭表单并刷新后重试。" : g_app->configurationError());
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zone.id);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(formRevision);
            Esp32BaseWeb::sendChunk("'><div class='fieldgrid'><p class='field full'><label>水路名称</label><input name='name' maxlength='63' required value='"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data());
            Esp32BaseWeb::sendChunk("'><small>用于计划、运行和记录页面显示。</small></p><p class='field full'><label><input type='checkbox' name='enabled' value='1' "); if (zone.enabled) Esp32BaseWeb::sendChunk("checked");
            Esp32BaseWeb::sendChunk("> 启用这条水路</label><small>未安装的水路保持关闭，正常使用页面不会显示。</small></p></div><div class='actions'><button type='button' class='secondary' onclick='this.closest(\"dialog\").close()'>取消</button><input type='submit' value='保存'></div></form>");
            Esp32BaseWeb::sendChunk("</dialog>");
        }
    }
    if(failed && postedZone) { html("<script>var d=document.getElementById('zone-");sendUnsigned(postedZone);html("');if(d)d.showModal();</script>"); }
    else if(failed) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,"未保存修改","水路参数无效。");
    endPage();
}

void IrrigationWeb::activeTask() {
    if (!beginPage("首页", "查看当前任务的实时状态")) return;
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeStyle);
    conditions();
    IrrigationWebAssets::send(IrrigationWebAssets::Asset::ActiveTaskStyle);
    const IrrigationConfig* config = g_app->configuration();
    const WateringStatus status = g_app->wateringStatus();
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    const bool timeTrusted =
        now.synced &&
        g_app->schedulerTimeState() == WateringScheduler::TimeState::Ready;
    const IrrigationEvents::ConditionDisplayState rtcCondition =
        g_app->eventConditionState(1);
    const bool rtcUnavailable =
        rtcCondition == IrrigationEvents::ConditionDisplayState::Active ||
        rtcCondition == IrrigationEvents::ConditionDisplayState::ConfirmingRecovery;
    char clockValue[24]{};
    char clockDate[32]{};
    Esp32BaseWeb::sendChunk("<section class='run-context'><div class='run-context-status'><span class='tag info'>任务运行中</span><b>");
    Esp32BaseWeb::writeHtmlEscaped(wateringStateName(status.state));
    Esp32BaseWeb::sendChunk("</b></div><div id='run-clock' class='run-clock'");
    if (timeTrusted) {
        Esp32BaseWeb::sendChunk(" data-epoch='");
        sendUnsigned(now.epochSec);
        Esp32BaseWeb::sendChunk("'");
    }
    Esp32BaseWeb::sendChunk("><b id='run-clock-time' class='run-clock-time'>");
    if (timeTrusted &&
        Esp32BaseTime::formatEpoch(now.epochSec, clockValue,
                                   sizeof(clockValue), "%H:%M:%S")) {
        Esp32BaseWeb::writeHtmlEscaped(clockValue);
    } else {
        Esp32BaseWeb::sendChunk("时间尚未就绪");
    }
    Esp32BaseWeb::sendChunk("</b><span class='run-clock-date'><span id='run-clock-date'>");
    if (timeTrusted &&
        formatChineseDate(now.epochSec, clockDate, sizeof(clockDate))) {
        Esp32BaseWeb::writeHtmlEscaped(clockDate);
        Esp32BaseWeb::sendChunk("</span>");
        Esp32BaseWeb::sendChunk(
            now.source == Esp32BaseTime::SOURCE_NTP ? " · NTP 校时"
                                                     : " · RTC 时间");
    } else {
        Esp32BaseWeb::sendChunk("等待 RTC 或 NTP 提供可信时间</span>");
    }
    Esp32BaseWeb::sendChunk("</span>");
    if (rtcUnavailable) {
        Esp32BaseWeb::sendChunk("<a class='run-clock-warning' href='/irrigation#conditions'>硬件时钟不可用 · 断网后计划可能暂停</a>");
    }
    Esp32BaseWeb::sendChunk("</div></section><script>(function(){var clock=document.getElementById('run-clock'),time=document.getElementById('run-clock-time'),date=document.getElementById('run-clock-date');if(!clock||!clock.dataset.epoch)return;var base=Number(clock.dataset.epoch),started=performance.now();function pad(v){return String(v).padStart(2,'0')}function update(){var epoch=base+Math.floor((performance.now()-started)/1000),d=new Date((epoch+28800)*1000);if(time)time.textContent=pad(d.getUTCHours())+':'+pad(d.getUTCMinutes())+':'+pad(d.getUTCSeconds());if(date)date.textContent=d.getUTCFullYear()+'年'+(d.getUTCMonth()+1)+'月'+d.getUTCDate()+'日'}update();setInterval(update,1000)})();</script>");
    if (status.purpose != WateringPurpose::Normal) {
        Esp32BaseWeb::beginPanel("当前维护任务");
        Esp32BaseWeb::sendChunk("<div class='run-live-head'><div><span>维护任务</span><h3>");
        Esp32BaseWeb::sendChunk("基准流量学习");
        Esp32BaseWeb::sendChunk("</h3><p>任务正在设备上继续运行，请返回专属页面查看数据或停止。</p></div><a class='btnlink info' href='");
            Esp32BaseWeb::sendChunk("/irrigation/zones/learning?zone=");
            sendUnsigned(status.activeZoneId);
        Esp32BaseWeb::sendChunk("'>查看任务</a></div><form method='post' action='/irrigation'><input type='hidden' name='action' value='stop'><button class='danger'>停止当前任务</button></form>");
        Esp32BaseWeb::endPanel();
        Esp32BaseRecordStore::StoreStatus history{}; g_app->readWateringRecordStoreStatus(history);
        html("<div data-home-watch='maintenance' data-record-next='");sendUnsigned(history.nextRecordId);html("'></div>");
        IrrigationWebAssets::send(IrrigationWebAssets::Asset::HomeScript);

